[
    {
      "id": 1,
      "slug": "record-podcast-remotely",
      "title": "Horse riding after a long time",
      "description": "Halloween is always celebrated like a very special occassion in Van Hoouston Academy. Our vice principal owns two horses and was kind enough to grant a free ride on the horse to all the teachers",
      "content": "Full article text here... You can write multiple paragraphs.\n\nUse \\n\\n between paragraphs.",
      "author": "Valerie Martin",
      "date": "October 11, 2025",
      "readTime": "8 min",
      "tag": "Lifestyle",
      "category": "Van Houston Academy Blog",
      "image": "https://i.postimg.cc/VNbvBHPR/Chat-GPT-Image-Dec-1-2025-at-10-26-10-AM.png",
      "featured": false
    },
    {
        "id": 2,
        "slug": "when-math-started-to-feel-like-my-superpower",
        "title": "When Math Started To Feel Like My Superpower",
        "description": "A personal story about how math slowly went from being another subject in school to the place where I felt most confident, curious, and alive.",
        "content": "I did not wake up one day and decide that I was good at math. For a long time, math was just another subject on the timetable, squeezed between language arts and science, a tangle of numbers and symbols that I tried to survive rather than enjoy. What changed was not the textbook or the syllabus. What changed was the way I started to see patterns.\n\nThe first time I remember feeling a spark was during a fractions lesson. Everyone in the class seemed a little lost, and the board was crowded with circles sliced into pieces. Our teacher, probably noticing the confusion, switched tactics and used a story about sharing slices of pizza with friends. Suddenly, the pieces of the circle were not just abstract wedges; they were my slice, my friend's slice, the idea of fairness written in numbers. I answered a question, then another, then another. Each correct answer landed like a small click in my mind, and I remember thinking, maybe this is not so scary.\n\nOver time, I started to notice that math questions felt like puzzles rather than punishments. I liked the feeling of taking something messy and turning it into something clean. An equation starts out as a jumble of symbols, but step by step it becomes a neat, simple statement: x equals this. There is something strangely calming about that journey from chaos to clarity.\n\nThe real turning point came when I began helping classmates. At first it was small: a friend whispering, I do not get this, can you show me? I would slide my notebook over and quietly walk through the steps. I realized that explaining the process out loud made the ideas feel even clearer in my own mind. Teaching forced me to slow down and ask, what is actually happening here, and why?\n\nI was not the best at everything in school. I was not the fastest runner, or the best artist, or the most confident speaker. But in math class, I found a space where I could breathe. Numbers did not care about how loud I was or how fashionable my shoes were. They cared about logic, persistence, and the willingness to try again when the first attempt went wrong. That was the kind of competition I could live with.\n\nThere were still hard topics. Algebra looked strange at first, with letters suddenly living among the numbers. Geometry felt like it belonged to a secret club of people who could see shapes floating in their heads. But because I had already had that tiny taste of success with fractions, I tackled new topics with a different mindset: not what if I fail, but what if I can figure this out?\n\nOne afternoon, our teacher handed out a challenge worksheet. It had problems that went beyond the textbook examples, the kind where you cannot just follow a recipe; you have to think. I remember staring at one problem that involved a pattern of numbers. At first, I could not see it. But after a few minutes of scribbling and crossing things out, the pattern suddenly popped: each term was built from the sum of the previous two. I felt a rush of satisfaction that had nothing to do with grades. It was the thrill of discovery, even on a tiny scale.\n\nSlowly, I began to see myself differently. I stopped saying things like I am bad at math or I am just lucky when I get answers right. Instead, I started to recognize the work behind my progress: the extra problems I solved, the questions I asked after class, the times I checked my mistakes and tried again. Confidence in math did not arrive as a gift; it was built, brick by brick.\n\nThat growing confidence began to spill into other parts of my life. Because math taught me to break big problems into smaller steps, I used the same approach when I faced challenges outside the classroom. Overwhelming tasks became more manageable when I treated them like equations: understand the problem, identify what is missing, and move one step at a time.\n\nLooking back, math became my superpower not because I could calculate faster than everyone else, but because it gave me a way to think, to stay calm in front of problems, and to trust that effort leads to understanding. The most surprising part was realizing that this feeling did not have to be mine alone. If I could help other kids reach that click moment, where confusion turns into clarity, then math could become their superpower too.\n\nThat is the seed of why I later felt such a strong pull toward teaching. I know how heavy it feels to sit in class thinking I am just not a math person. I also know the joy that comes from finally solving something that once looked impossible. Between those two feelings is where I want to spend my life: standing beside students, showing them that they are far more capable than they think, and watching their faces light up when numbers start to make sense.",
        "author": "Miss Martin",
        "date": "November 30, 2024",
        "readTime": "11 min",
        "tag": "Math mindset",
        "category": "Personal Story",
        "image": "https://i.postimg.cc/d3kbx2Y1/pic.jpg",
        "imageAlt": "Teacher helping a young student with math homework at a desk",
        "featured": false
      },
      {
        "id": 3,
        "slug": "why-teaching-math-to-kids-became-my-favorite-equation",
        "title": "Why Teaching Math To Kids Became My Favorite Equation",
        "description": "From quiet student who loved solving problems to teacher who loves watching kids discover their own math power, this is the story of how I knew I had to share what I had learned.",
        "content": "There is a moment in almost every math lesson that I live for. It is not when I finish explaining a concept, and it is not when students copy the final answer into their notebooks. It is that tiny, almost invisible pause when a student looks at a problem, frowns, and then suddenly their eyes widen just a little. They whisper, ohhh, now I get it. That shift from confusion to understanding is the reason I knew I had to teach math.\n\nThe decision did not arrive as a grand career plan. It started in small, everyday scenes. I would see younger students in the hallway clutching their math books the way someone might carry a heavy suitcase. I heard the same sentences over and over: I hate math, I am not a math person, I will never get this. Those sentences hurt, because I remembered being in their shoes. I also knew that the story does not have to end there.\n\nWhen I first started helping younger kids with homework, I treated it like a favor. I would sit beside them, listen to their teacher's instructions, and walk through the steps. But over time something changed. I stopped feeling like I was simply fixing their worksheet and started feeling like I was giving them a new pair of glasses. Suddenly, the blurry mess of numbers had shape and meaning.\n\nOne of the first kids who made me realize how much I loved teaching was a shy student who always hid at the back of the classroom. When we worked on fractions, she would barely speak. Her notebook was full of half-erased attempts. One day, I drew a simple picture: a chocolate bar divided into squares. We talked about sharing it fairly with her siblings. As we turned each shaded piece into a fraction, she leaned closer, curious. By the end of that session she was the one drawing the chocolate bars and explaining them back to me. The next week in class, she raised her hand for the first time. That moment felt better than any test score I had ever received.\n\nTeaching math to kids showed me that the subject is not cold or distant. It is deeply human. Behind every problem there is a story: how many chairs we need for a party, how much time it takes to finish a game level, how many pieces of paper we can cut from a sheet without wasting any. When children see themselves inside the numbers, they start to care about the answers. My job, I realized, is to build that bridge between everyday life and the abstract language of math.\n\nI also discovered that kids do not just need explanations; they need encouragement. Many of them have collected small scars from years of being told that they are slow, distracted, or simply not good at this. When a child believes that, their brain stops looking for patterns. My favorite equation is not x plus y equals z. It is effort plus encouragement equals confidence.\n\nThe more I taught, the more I refined my own understanding. Topics that once felt routine became fresh again when I saw them through a child's eyes. Place value is not just a rule about tens and hundreds; it is the idea that 9 can suddenly become 90 or 900 simply by shifting position. Multiplication is not just memorizing tables; it is repeated addition, groups of friends, rows of trees in a garden. Every time I looked for a new story or visual way to explain a concept, I was forced to think more creatively about math itself.\n\nThere is also something powerful about giving children permission to make mistakes. In many classrooms, getting the wrong answer is treated like a small failure. In my sessions, I try to flip that. Wrong answers are clues. They tell us where the thinking went, which step we need to revisit, what misconception we can clear up. When kids realize that mistakes are allowed, they take more risks, ask more questions, and actually learn faster.\n\nAs I kept teaching, I understood that I was not just sharing methods; I was sharing a mindset. I wanted children to leave my lessons believing three things: that math is understandable, that they are capable of learning it, and that when they get stuck, there is always another strategy they can try. Those beliefs are far more valuable than any single formula.\n\nLittle by little, my identity shifted. I was not just someone who was good at math; I was someone who could help others feel good at math too. Friends started sending their younger siblings to me for help. Parents asked if I could run small study groups. Each new group confirmed the same truth: kids do not hate math; they hate feeling lost. When we give them clear explanations, patient guidance, and a safe place to practice, most of them surprise themselves.\n\nToday, when I think about my future, I see classrooms full of curious faces, whiteboards crowded with diagrams, and sticky notes covered in questions. I imagine designing lessons where games, stories, and visuals make abstract ideas come alive. I picture students who start the year whispering I cannot do this and end the year boldly tackling problems they would once have avoided.\n\nTeaching math to kids has become my favorite equation because it combines everything I care about: the beauty of logical thinking, the joy of watching someone grow, and the belief that confidence can be taught. I know what it feels like to move from doubt to understanding, and I want as many children as possible to experience that same shift. Every time a student looks up from their paper with a small, proud smile, I am reminded why I chose this path. In that moment, the answer is always clear.",
        "author": "Miss Martin",
        "date": "December 2, 2024",
        "readTime": "12 min",
        "tag": "Teaching journey",
        "category": "Personal Story",
        "image": "https://i.postimg.cc/tCqF9yFV/pic1.jpg",
        "imageAlt": "Teacher and student standing in front of a board filled with math equations",
        "featured": true
      },
    {
      "id": 4,
      "slug": "phone-as-webcam",
      "title": "How to Use Your Phone as a Webcam in 5 Minutes",
      "description": "Turn your smartphone into a sharp, clean webcam for meetings or streams.",
      "content": "Full article text for this post...",
      "author": "Alex Johnson",
      "date": "June 26, 2024",
      "readTime": "14 min",
      "tag": "Studio equipment",
      "category": "Tutorial",
      "image": "https://images.pexels.com/photos/6898859/pexels-photo-6898859.jpeg?auto=compress&cs=tinysrgb&w=600",
      "featured": false
    }

  ]
  